In [1]:
# Create a lambda function that will take an input and tells whether the number if even or odd

even_odd=(lambda x: 'even' if x%2==0 else 'odd')
even_odd(7)

'odd'

In [2]:
even_odd(100)

'even'

### Apply

- Continuous ---> Numerical or discrete
- Categorical ----> Ordinal and Nominal

    - Ordinal Data - Have some kind of order

        - Education 
        - Position at some Firm 
        - Position in a competition


    - Nominal Data - Have no order

        - Gender 
        - Blood Group 
        - Different species of roses

              - Encoding

                - Label encoding
                - One hot encoding

In [1]:
import seaborn as sns

In [2]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [14]:
data = sns.load_dataset('titanic')
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [15]:
data

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [17]:
data.shape # shape is an attribute which tells how many rows and columns my dataset has

(891, 15)

In [24]:
# I wish to Label encode sex column means male-1 and female-0

data['Gender'] = data['sex'].apply(lambda x: 1 if x == 'male' else 0)

In [25]:
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,Gender,Class,Alive
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1,3,0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0,1,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,0,3,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0,1,1
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1,3,0

In [20]:
# I wish to label encode this class column such that First-1, Second-2 and Third-3

data['Class'] = data['class'].apply(lambda x: 1 if x == 'First' else 2 if x == 'Second' else 3)

In [21]:
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,Gender,Class
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1,3
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,0,3
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0,1
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1,3

In [22]:
# Label encode the alive columne such that no - 0 and yes - 1data['alive'].apply(lambda x: 1 if x=="yes" else 0)data['alive'].apply(lambda x: 1 if x=="yes" else 0)
data['Alive'] = data['alive'].apply(lambda x: 0 if x=='no' else 1)

In [23]:
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,Gender,Class,Alive
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1,3,0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0,1,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,0,3,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0,1,1
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1,3,0

### filter(), map() and reduce()

### filter() function 

- It takes wo arguments, the first argument is a function (named function or lambda function) and the second argument is going to be an iterable object
- We are going to pass 1 argument onky in the filter() function
- It filters the value from an iterable on the basis of some condition (whenever the condition is True)
- filter() function will store those values for which the given condition is True
- It will return a filter object 
- To fetch out the value from this filter object, we have to typecast it to either a list or a tuple

    Syntax:
        
        filter(function, iterable)
        filter(lambda argument: operation, iterable)

In [26]:
lst = [i for i in range(1,21)]
lst

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

In [27]:
# I want to create a list having only even numbers 

result = [i for i in range(1,21) if i%2 ==0]
result

[2, 4, 6, 8, 10, 12, 14, 16, 18, 20]

In [31]:
# named function 

def even(x):
    if x%2 == 0:
        return True

In [32]:
f = filter(even, lst)
f

In [33]:
a = list(f)
a

[2, 4, 6, 8, 10, 12, 14, 16, 18, 20]

In [34]:
# lambda function 

b = list(filter(lambda x: x%2==0, lst))
b

[2, 4, 6, 8, 10, 12, 14, 16, 18, 20]

In [36]:
# I have to filter odd element out of a list

lst = [i for i in range(1,51)]

f = list(filter(lambda x: x%2 != 0, lst))
print(f)

# x = 1 ---> x%2 != 0 ----> True ----> 1
# x = 2 ---> x%2 != 0 ----> False

[1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49]

In [37]:
text = 'Hello everyone!, I hope your learning is going on well'

# filter out the vowels from the text 

a = list(filter(lambda x: x in 'aeiouAEIOU', text))
print(a)

# x ---> 'H' ----> x in 'aeiouAEIOU'----> False
# x ---> 'e' ----> x in 'aeiouAEIOU' ----> True

['e', 'o', 'e', 'e', 'o', 'e', 'I', 'o', 'e', 'o', 'u', 'e', 'a', 'i', 'i', 'o', 'i', 'o', 'e']

In [38]:
# list comprehension

text = 'Hello everyone!, I hope your learning is going on well'
vowels = [i for i in text if i in 'aeiouAEIOU']
print(vowels)

['e', 'o', 'e', 'e', 'o', 'e', 'I', 'o', 'e', 'o', 'u', 'e', 'a', 'i', 'i', 'o', 'i', 'o', 'e']

### map() function 

- It will also take two arguments, where the first argument is a function (named function or lambda function) and the second element will be an iterable
- The function that we pass in map() function will take 1 argument only
- It perform specifed operatioon on each element of an iterable and returns a map object
- To fetch the values out of this map object we have to typecast them to either a list or a tuple

    Syntax:
        
        map(function, iterable)
        map(lambda argument: operation, iterable)

In [40]:
lst = [i for i in range(1, 21)]
lst

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

In [42]:
# list comprehension create a list in which every element of the list of is multiplied by 5

five_times_lst = [i*5 for i in lst]
print(five_times_lst)

[5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95, 100]

In [44]:
res = list(map(lambda x: x*5, lst))
print(res)

[5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95, 100]

In [45]:
data['gender'] = list(map(lambda x: 1 if x == 'male' else 0, data['sex']))
data.head()

# x = 'male' ---> 1
# x = 'female' ---> 0

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,Gender,Class,Alive,gender
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1,3,0,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0,1,1,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,0,3,1,0
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0,1,1,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1,3,0,1

In [47]:
d = {i:i for i in range(1,11)}
d

{1: 1, 2: 2, 3: 3, 4: 4, 5: 5, 6: 6, 7: 7, 8: 8, 9: 9, 10: 10}

In [48]:
d.values()

dict_values([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])

In [49]:
res = list(map(lambda x: x**3, list(d.values())))
print(res)

# x = 1 ---> 1**3 --->1 ---> store in map
# x = 2----> 2 **3 ---> 8 ----> store in map

[1, 8, 27, 64, 125, 216, 343, 512, 729, 1000]

### Reduce()

- It is available in the functools module in python
- It is used to perform some aggregation operation on the values of an iterable
- It also will take two arguments, where the first argument is a function and the second argument is an itearble object
- The function that we pass in the reduce function() will going to take only 1 argument in it 
- It is going to return one value at the end
- To use reduce() function, we first have to import functools module to our jupyter notebook

In [50]:
from functools import reduce

In [51]:
lst

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

In [52]:
# cummulative sum

s = 0 

for i in lst:
    s += i

print(s)

210

In [65]:
reduce(lambda x, y: x*y, [1,2,3,4])

# x= 1, y = 2, x*y = 2
# x = 2, y = 3, x*y = 6
# x = 6, y = 4, x*y = 24

24

In [53]:
reduce(lambda x, y: x+y, lst)

210

In [ ]:
x = 1, y = 2, x+y = 3
x = 3, y = 3 , x+y = 6
x = 6, y = 4, x+y = 10
x = 10, y = 5, x+y = 15
x = 15, y = 6, x+y = 21
x = 21, y = 7, x+y = 28
x = 28, y = 8, x+y = 36
x = 36, y = 9, x+y = 45
x = 45 y = 10, x+y = 55
x = 55, y = 11, x+y = 66
x = 66, y = 12, x+y = 78
x = 78, y = 13, x+y = 91
x = 91, y = 14, x+y = 105
x = 105, y = 15, x+y = 120
x = 120, y = 16, x+y = 136
x = 136, y = 17,  x+y = 153
x = 153, y = 18, x+y = 171
x = 171, y = 19, x+y = 190
x = 190, y = 20, x+y = 210

In [55]:
reduce(lambda x, y : max(x,y), lst)

20

In [59]:
total_sum = reduce(lambda x, y :x+y, lst)
average = total_sum/len(lst)

In [60]:
average

10.5

In [61]:
reduce(lambda x, y : min(x,y), lst)

1

- Filter ----> filtter the list means the len(filtered lst)<actual_lst
- map -----> map the list means len(mapped_lst) = len(actaul_lst)
- reduce ----> here it will return a single value

In [66]:
import functools

In [67]:
print(dir(functools))

['GenericAlias', 'RLock', 'WRAPPER_ASSIGNMENTS', 'WRAPPER_UPDATES', '_CacheInfo', '_HashedSeq', '_NOT_FOUND', '__all__', '__builtins__', '__cached__', '__doc__', '__file__', '__loader__', '__name__', '__package__', '__spec__', '_c3_merge', '_c3_mro', '_compose_mro', '_convert', '_find_impl', '_ge_from_gt', '_ge_from_le', '_ge_from_lt', '_gt_from_ge', '_gt_from_le', '_gt_from_lt', '_initial_missing', '_le_from_ge', '_le_from_gt', '_le_from_lt', '_lru_cache_wrapper', '_lt_from_ge', '_lt_from_gt', '_lt_from_le', '_make_key', '_unwrap_partial', 'cache', 'cached_property', 'cmp_to_key', 'get_cache_token', 'lru_cache', 'namedtuple', 'partial', 'partialmethod', 'recursive_repr', 'reduce', 'singledispatch', 'singledispatchmethod', 'total_ordering', 'update_wrapper', 'wraps']

In [68]:
import numpy as np

In [69]:
print(dir(np))

['ALLOW_THREADS', 'AxisError', 'BUFSIZE', 'CLIP', 'ComplexWarning', 'DataSource', 'ERR_CALL', 'ERR_DEFAULT', 'ERR_IGNORE', 'ERR_LOG', 'ERR_PRINT', 'ERR_RAISE', 'ERR_WARN', 'FLOATING_POINT_SUPPORT', 'FPE_DIVIDEBYZERO', 'FPE_INVALID', 'FPE_OVERFLOW', 'FPE_UNDERFLOW', 'False_', 'Inf', 'Infinity', 'MAXDIMS', 'MAY_SHARE_BOUNDS', 'MAY_SHARE_EXACT', 'ModuleDeprecationWarning', 'NAN', 'NINF', 'NZERO', 'NaN', 'PINF', 'PZERO', 'RAISE', 'RankWarning', 'SHIFT_DIVIDEBYZERO', 'SHIFT_INVALID', 'SHIFT_OVERFLOW', 'SHIFT_UNDERFLOW', 'ScalarType', 'Tester', 'TooHardError', 'True_', 'UFUNC_BUFSIZE_DEFAULT', 'UFUNC_PYVALS_NAME', 'VisibleDeprecationWarning', 'WRAP', '_CopyMode', '_NoValue', '_UFUNC_API', '__NUMPY_SETUP__', '__all__', '__builtins__', '__cached__', '__config__', '__deprecated_attrs__', '__dir__', '__doc__', '__expired_functions__', '__file__', '__former_attrs__', '__future_scalars__', '__getattr__', '__git_version__', '__loader__', '__mkl_version__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_add_newdoc_ufunc', '_builtins', '_distributor_init', '_financial_names', '_get_promotion_state', '_globals', '_int_extended_msg', '_mat', '_no_nep50_warning', '_pyinstaller_hooks_dir', '_pytesttester', '_set_promotion_state', '_specific_msg', '_version', 'abs', 'absolute', 'add', 'add_docstring', 'add_newdoc', 'add_newdoc_ufunc', 'all', 'allclose', 'alltrue', 'amax', 'amin', 'angle', 'any', 'append', 'apply_along_axis', 'apply_over_axes', 'arange', 'arccos', 'arccosh', 'arcsin', 'arcsinh', 'arctan', 'arctan2', 'arctanh', 'argmax', 'argmin', 'argpartition', 'argsort', 'argwhere', 'around', 'array', 'array2string', 'array_equal', 'array_equiv', 'array_repr', 'array_split', 'array_str', 'asanyarray', 'asarray', 'asarray_chkfinite', 'ascontiguousarray', 'asfarray', 'asfortranarray', 'asmatrix', 'atleast_1d', 'atleast_2d', 'atleast_3d', 'average', 'bartlett', 'base_repr', 'binary_repr', 'bincount', 'bitwise_and', 'bitwise_not', 'bitwise_or', 'bitwise_xor', 'blackman', 'block', 'bmat', 'bool_', 'broadcast', 'broadcast_arrays', 'broadcast_shapes', 'broadcast_to', 'busday_count', 'busday_offset', 'busdaycalendar', 'byte', 'byte_bounds', 'bytes_', 'c_', 'can_cast', 'cast', 'cbrt', 'cdouble', 'ceil', 'cfloat', 'char', 'character', 'chararray', 'choose', 'clip', 'clongdouble', 'clongfloat', 'column_stack', 'common_type', 'compare_chararrays', 'compat', 'complex128', 'complex64', 'complex_', 'complexfloating', 'compress', 'concatenate', 'conj', 'conjugate', 'convolve', 'copy', 'copysign', 'copyto', 'corrcoef', 'correlate', 'cos', 'cosh', 'count_nonzero', 'cov', 'cross', 'csingle', 'ctypeslib', 'cumprod', 'cumproduct', 'cumsum', 'datetime64', 'datetime_as_string', 'datetime_data', 'deg2rad', 'degrees', 'delete', 'deprecate', 'deprecate_with_doc', 'diag', 'diag_indices', 'diag_indices_from', 'diagflat', 'diagonal', 'diff', 'digitize', 'disp', 'divide', 'divmod', 'dot', 'double', 'dsplit', 'dstack', 'dtype', 'e', 'ediff1d', 'einsum', 'einsum_path', 'emath', 'empty', 'empty_like', 'equal', 'errstate', 'euler_gamma', 'exp', 'exp2', 'expand_dims', 'expm1', 'expm1x', 'extract', 'eye', 'fabs', 'fastCopyAndTranspose', 'fft', 'fill_diagonal', 'find_common_type', 'finfo', 'fix', 'flatiter', 'flatnonzero', 'flexible', 'flip', 'fliplr', 'flipud', 'float16', 'float32', 'float64', 'float_', 'float_power', 'floating', 'floor', 'floor_divide', 'fmax', 'fmin', 'fmod', 'format_float_positional', 'format_float_scientific', 'format_parser', 'frexp', 'from_dlpack', 'frombuffer', 'fromfile', 'fromfunction', 'fromiter', 'frompyfunc', 'fromregex', 'fromstring', 'full', 'full_like', 'gcd', 'generic', 'genfromtxt', 'geomspace', 'get_array_wrap', 'get_include', 'get_printoptions', 'getbufsize', 'geterr', 'geterrcall', 'geterrobj', 'gradient', 'greater', 'greater_equal', 'half', 'hamming', 'hanning', 'heaviside', 'histogram', 'histogram2d', 'histogram_bin_edges', 'histogramdd', 'hsplit', 'hstack', 'hypot', 'i0', 'identity', 'iinfo', 'imag', 'in1d', 'index_exp', 'indices', 'inexact', 'inf', 'info', 'infty', 'inner', 'insert', 'int16', 'int32', 'int64', 'int8', 'int_', 'intc', 'integer', 'interp', 'intersect1d', 'intp', 'invert', 'is_busday', 'isclose', 'iscomplex', 'iscomplexobj', 'isfinite', 'isfortran', 'isin', 'isinf', 'isnan', 'isnat', 'isneginf', 'isposinf', 'isreal', 'isrealobj', 'isscalar', 'issctype', 'issubclass_', 'issubdtype', 'issubsctype', 'iterable', 'ix_', 'kaiser', 'kron', 'lcm', 'ldexp', 'left_shift', 'less', 'less_equal', 'lexsort', 'lib', 'linalg', 'linspace', 'little_endian', 'load', 'loadtxt', 'log', 'log10', 'log1p', 'log2', 'logaddexp', 'logaddexp2', 'logical_and', 'logical_not', 'logical_or', 'logical_xor', 'logspace', 'longcomplex', 'longdouble', 'longfloat', 'longlong', 'lookfor', 'ma', 'mask_indices', 'mat', 'math', 'matmul', 'matrix', 'max', 'maximum', 'maximum_sctype', 'may_share_memory', 'mean', 'median', 'memmap', 'meshgrid', 'mgrid', 'min', 'min_scalar_type', 'minimum', 'mintypecode', 'mkl', 'mod', 'modf', 'moveaxis', 'msort', 'multiply', 'nan', 'nan_to_num', 'nanargmax', 'nanargmin', 'nancumprod', 'nancumsum', 'nanmax', 'nanmean', 'nanmedian', 'nanmin', 'nanpercentile', 'nanprod', 'nanquantile', 'nanstd', 'nansum', 'nanvar', 'nbytes', 'ndarray', 'ndenumerate', 'ndim', 'ndindex', 'nditer', 'negative', 'nested_iters', 'newaxis', 'nextafter', 'nonzero', 'not_equal', 'numarray', 'number', 'obj2sctype', 'object_', 'ogrid', 'oldnumeric', 'ones', 'ones_like', 'outer', 'packbits', 'pad', 'partition', 'percentile', 'pi', 'piecewise', 'place', 'poly', 'poly1d', 'polyadd', 'polyder', 'polydiv', 'polyfit', 'polyint', 'polymul', 'polynomial', 'polysub', 'polyval', 'positive', 'power', 'printoptions', 'prod', 'product', 'promote_types', 'ptp', 'put', 'put_along_axis', 'putmask', 'quantile', 'r_', 'rad2deg', 'radians', 'random', 'ravel', 'ravel_multi_index', 'real', 'real_if_close', 'rec', 'recarray', 'recfromcsv', 'recfromtxt', 'reciprocal', 'record', 'remainder', 'repeat', 'require', 'reshape', 'resize', 'result_type', 'right_shift', 'rint', 'roll', 'rollaxis', 'roots', 'rot90', 'round', 'round_', 'row_stack', 's_', 'safe_eval', 'save', 'savetxt', 'savez', 'savez_compressed', 'sctype2char', 'sctypeDict', 'sctypes', 'searchsorted', 'select', 'set_numeric_ops', 'set_printoptions', 'set_string_function', 'setbufsize', 'setdiff1d', 'seterr', 'seterrcall', 'seterrobj', 'setxor1d', 'shape', 'shares_memory', 'short', 'show_config', 'show_runtime', 'sign', 'signbit', 'signedinteger', 'sin', 'sinc', 'single', 'singlecomplex', 'sinh', 'size', 'sometrue', 'sort', 'sort_complex', 'source', 'spacing', 'split', 'sqrt', 'square', 'squeeze', 'stack', 'std', 'str_', 'string_', 'subtract', 'sum', 'swapaxes', 'take', 'take_along_axis', 'tan', 'tanh', 'tensordot', 'test', 'testing', 'tile', 'timedelta64', 'trace', 'tracemalloc_domain', 'transpose', 'trapz', 'tri', 'tril', 'tril_indices', 'tril_indices_from', 'trim_zeros', 'triu', 'triu_indices', 'triu_indices_from', 'true_divide', 'trunc', 'typecodes', 'typename', 'ubyte', 'ufunc', 'uint', 'uint16', 'uint32', 'uint64', 'uint8', 'uintc', 'uintp', 'ulonglong', 'unicode_', 'union1d', 'unique', 'unpackbits', 'unravel_index', 'unsignedinteger', 'unwrap', 'use_hugepage', 'ushort', 'vander', 'var', 'vdot', 'vectorize', 'version', 'void', 'vsplit', 'vstack', 'where', 'who', 'zeros', 'zeros_like']

### Recursive Function 

- When the function calls itself then it is called a recursive function 
- Once the process is inititiated, it will execute the code infinite number of times, if we don't terminate the code


    Syntax:
        
        def recursive_func():
            code
            code
            recrusive_call()

In [70]:
def password(pas):
    face_pass = 'ABC@123'
    
    if pas == face_pass:
        print('You have successfully logged in')
    else:
        print('Invalid Password! Try again')
        x = input('Enter the password: ')
        password(x)

In [71]:
password('mickey0195@')

Invalid Password! Try again
Enter the password: mayankatulghai1195
Invalid Password! Try again
Enter the password: ABC@123
You have successfully logged in

In [74]:
def password():
    
    x = input('Enter the password: ')
    face_pass = 'ABC@123'
    
    if x == face_pass:
        print('You have successfully logged in')
    else:
        print('Invalid Password! Try again')
        
        password()

In [75]:
password()

Enter the password: Maa2365@
Invalid Password! Try again
Enter the password: Mayank
Invalid Password! Try again
Enter the password: Atul
Invalid Password! Try again
Enter the password: ABC@123
You have successfully logged in

In [ ]:
# Factorial 
# fibbonacci series

In [ ]:
5! = 5*4*3*2*1
6! = 6*5*4*3*2*1

n! = n*n-1!

In [ ]:
a = 0, b = 1
[0,1,1,2,3,5,8,13,...........]

In [ ]:
Fear ---> Forget everything and run
          Face everything and rise

In [ ]:
neon number
armstrong
palindrome
strong